{
    "name": "Charlotte Stone",
    "title": "Software Developer, Translator",
    "learnMore": "Learn More",
    "infoBar": "Charlotte Stone is currently open to new opportunities! Get in contact to discuss your project or translation needs.",
    "contact": "Contact",
    "about": "About",
    "hello": "Hello!",
    "aboutText1": "I’m Charlotte, a passionate full-stack web developer based in the Staffordshire area. With over five years of experience in technical support and software engineering, I specialize in creating dynamic websites using JavaScript, Python, React, Node, Django, and more. My approach is human-centered, focused on delivering tangible value and ensuring seamless user experiences.",
    "aboutText2": "I possess a robust background in translation, having engaged in diverse projects spanning technology and education sectors. While English is my native language, I am proficient in Japanese and French while also conversant in various other languages. I am continuously seeking new opportunities to assist businesses in reaching a global audience.",
    "technologies": "Technologies",
    "home": "Home",
    "languages": "Languages",
    "project": "Projects",    
    "RecentProjects": "Recent Projects",
    "projects": {
        "1": {
            "title": "My Github Profile",
            "description": "View more of my work on Github.",
            "altText": "View more of my work on Github."
        },
        "2": {
            "title": "ByteWise Language Labs",
            "description": "This is a landing page for a fictitious language teaching site using quotes from former colleagues. It was built using; HTML, CSS and JavaScript.",
            "altText": "Image of a website I've made."
        },
        "3": {
            "title": "My Mixtape",
            "description": "This is a site for creating and sharing mixtapes using online links. It was built using; JavaScript, Python and Django.",
            "altText": "Image of a website I've made."
        },
        "4": {
            "title": "Sekai Experience",
            "description": "This is a site for posting and sharing experiences. It was built using; EJS, NodeJS, Express and MongoDB.",
            "altText": "Image of a website I've made."
        },
        "5": {
            "title": "Sapphy Doyle Profile Site",
            "description": "This is the profile site for Sapphy Doyle. It was built using HTML, CSS, JavaScript and React.",
            "altText": "Image of a website I've made."
        },
        "6": {
            "title": "Desktop Pomodoro Timer and Checklist",
            "description": "The Pomodoro Timer and Checklist Application is a desktop productivity tool built using Electron, HTML, CSS, and JavaScript. It combines a Pomodoro timer for time management with a checklist feature for task organization.",
            "altText": "Pomodoro Timer and Checklist desktop app."
        }
    },
    "RecentTranslations": "Recent Translations",
    "translations":{
        "2": {
            "title": "My freeCodeCamp Profile",
            "description": "View more of my translations over on freeCodeCamp.",
            "altText": "View more of my translations over on freeCodeCamp."
        },
        "3": {
            "title": "Setting a Static IP in Ubuntu – Linux IP Address Tutorial",
            "description": "In most network configurations, the router DHCP server assigns the IP address dynamically by default. If you want to ensure that your system IP stays the same every time, you can force it to use a static IP. ",
            "altText": "How to set an IP in Ubuntu"
        },
        "4": {
            "title": "JSON Stringify Example – How to Parse a JSON Object with JS",
            "description": "JSON, or JavaScript Object Notation, is all around us. If you've ever used a web app, there's a very good chance that it used JSON to structure, store, and transmit data between its servers and your device.",
            "altText": "How to parse a JSON object with JavaScript"
        },
        "5": {
            "title": "How to Update Node and NPM to the Latest Version",
            "description": "Node is a runtime environment for executing JavaScript code outside of the browser, on the server side.",
            "altText": "How to Update Node and NPM to the Latest Version"
        },
        "6": {
            "title": "Bash Scripting Tutorial – Linux Shell Script and Command Line for Beginners",
            "description": "In Linux, process automation relies heavily on shell scripting. This involves creating a file containing a series of commands that can be executed together.",
            "altText": "Bash Scripting Tutorial – Linux Shell Script and Command Line for Beginners"
        },
        "7": {
            "title": "JavaScript Refresh Page – How to Reload a Page in JS",
            "description": "JavaScript is a versatile programming language that allows developers to create dynamic and interactive web applications. One common task in web development is to refresh or reload a web page, either to update its content or to trigger certain actions.",
            "altText": "JavaScript Refresh Page – How to Reload a Page in JS"
        }
    },
    "letMeHelpYou": "Let Me Help You!",
    "yourName": "Your Name",
    "yourEmail": "Your Email",
    "yourMessage": "Your Message",
    "sendMessage": "Send Message",
    "enterYourName": "Enter your name",
    "enterYourEmail": "Enter your email",
    "enterYourMessage": "Enter your message",
    "RecentPosts": "Recent Posts",
    "showMore": "Show More",
    "footer": "Designed and Developed by Charlotte Stone",
    "GithubIcon": "Github Icon",
    "freeCodeCampIcon": "freeCodeCamp Icon",
    "LinkedInIcon": "LinkedIn Icon",
    "blueSkyIcon": "Blue Sky Icon"
}
