{
    "name": "Charlotte Stone",
    "title": "Software Developer, Translator",
    "learnMore": "Learn More",
    "about": "About",
    "hello": "Heyya!",
    "aboutText1": "I’m Charlotte, a passionate full-stack web developer based in the Greater Swansea Area. With over five years of experience in technical support and software engineering, I specialize in creating dynamic websites using JavaScript, Python, React, Node, Django, and more. My approach is human-centered, focused on delivering tangible value and ensuring seamless user experiences.",
    "aboutText2": "I possess a robust background in translation, having engaged in diverse projects spanning technology and education sectors. While English is my native language, I am proficient in Japanese and French while also conversant in various other languages. I am continuously seeking new opportunities to assist businesses in reaching a global audience.",
    "RecentProjects": "Recent Projects",
    "projects": {
        "1": {
            "title": "Project 1",
            "description": "This is a description of Project 2.",
            "altText": "Image of a website I've made"
        },
        "2": {
            "title": "Project 2",
            "description": "This is a description of Project 2.",
            "altText": "Image of a website I've made"
        },

        "98": {
            "title": "Sapphy Doyle Profile Site",
            "description": "This is the profile site for Sapphy Doyle. It was built using HTML, CSS, JavaScript and React.",
            "altText": "Image of a website I've made"
        },
        "99": {
            "title": "Desktop Pomodoro Timer and Checklist",
            "description": "The Pomodoro Timer and Checklist Application is a desktop productivity tool built using Electron, HTML, CSS, and JavaScript. It combines a Pomodoro timer for time management with a checklist feature for task organization.",
            "altText": "Pomodoro Timer and Checklist desktop app"
        }
    },
    "RecentTranslations": "Recent Translations",
    "translations":{
        "1": {
            "title": "HTML Link – How to Turn an Image into a Link and Nest Links Inside Paragraphs",
            "description": "There will be times where you will want to nest links inside paragraphs or turn an image into a link. But how do you go about doing that in HTML?",
            "altText": "How to turn an image into a link and nest links inside paragraphs"
        },
        "2": {
            "title": "PHP Explode – How to Split a String into an Array",
            "description": "The PHP explode() function converts a string to an array. Each of the characters in the string is given an index that starts from 0. Like the built-in implode() function, the explode function does not modify the data (string).",
            "altText": "How to use Explode in PHP"
        },
        "3": {
            "title": "Setting a Static IP in Ubuntu – Linux IP Address Tutorial",
            "description": "In most network configurations, the router DHCP server assigns the IP address dynamically by default. If you want to ensure that your system IP stays the same every time, you can force it to use a static IP. ",
            "altText": "How to set an IP in Ubuntu"
        },
        "4": {
            "title": "JSON Stringify Example – How to Parse a JSON Object with JS",
            "description": "JSON, or JavaScript Object Notation, is all around us. If you've ever used a web app, there's a very good chance that it used JSON to structure, store, and transmit data between its servers and your device.",
            "altText": "How to parse a JSON object with JavaScript"
        },
        "5": {
            "title": "How to Update Node and NPM to the Latest Version",
            "description": "Node is a runtime environment for executing JavaScript code outside of the browser, on the server side.",
            "altText": "How to Update Node and NPM to the Latest Version"
        },
        "6": {
            "title": "Bash Scripting Tutorial – Linux Shell Script and Command Line for Beginners",
            "description": "In Linux, process automation relies heavily on shell scripting. This involves creating a file containing a series of commands that can be executed together.",
            "altText": "Bash Scripting Tutorial – Linux Shell Script and Command Line for Beginners"
        },
        "7": {
            "title": "JavaScript Refresh Page – How to Reload a Page in JS",
            "description": "JavaScript is a versatile programming language that allows developers to create dynamic and interactive web applications. One common task in web development is to refresh or reload a web page, either to update its content or to trigger certain actions.",
            "altText": "JavaScript Refresh Page – How to Reload a Page in JS"
        }
    },
    "RecentPosts": "Recent Posts",
    "footer": "Designed and Developed by Charlotte Stone"
}
