{
    "name": "Charlotte Stone",
    "title": "Datblygwr Meddalwedd, Cyfieithydd",
    "learnMore": "Dysgu Mwy",
    "infoBar": "Mae Charlotte Stone ar gael ar gyfer cyfleoedd newydd ar hyn o bryd! Cysylltwch i drafod eich prosiect neu anghenion cyfieithu.",
    "contact": "Cysylltu",
    "about": "Am",
    "hello": "Hwyl!",
    "aboutText1": "Fi yw Charlotte, datblygwr gwe llawn pentwr brwd sy'n byw yn Ardal Abertawe Fwyaf. Gyda mwy na phum mlynedd o brofiad mewn cefnogaeth dechnegol a pheirianneg meddalwedd, rwy'n arbenigo mewn creu gwefannau deinamig gan ddefnyddio JavaScript, Python, React, Node, Django, a mwy. Mae fy ymagwedd yn canolbwyntio ar bobl, gan ganolbwyntio ar ddarparu gwerth pendant a sicrhau profiadau defnyddiwr di-dor.",
    "aboutText2": "Mae gen i gefndir cadarn mewn cyfieithu, ar ôl cymryd rhan mewn prosiectau amrywiol yn rhychwantu sectorau technoleg ac addysg. Tra bod Saesneg yn iaith frodorol i mi, rwy'n rhugl yn Japaneeg a Ffrangeg tra hefyd yn gyfarwydd â sawl iaith arall. Rwy'n barhaus yn chwilio am gyfleoedd newydd i helpu busnesau i gyrraedd cynulleidfa fyd-eang.",
    "RecentProjects": "Prosiectau Diweddar",
    "projects": {
        "1": {
            "title": "ByteWise Language Labs",
            "description": "Dyma dudalen lanio ar gyfer safle dysgu iaith dychmygol gan ddefnyddio dyfyniadau gan gyn-gydweithwyr. Fe'i hadeiladwyd gan ddefnyddio; HTML, CSS a JavaScript.",
            "altText": "Delwedd o wefan rydw i wedi'i greu"
        },
        "2": {
            "title": "My Mixtape",
            "description": "Mae hwn yn safle ar gyfer creu a rhannu mixtapes gan ddefnyddio cysylltiadau ar-lein. Fe'i hadeiladwyd gan ddefnyddio; JavaScript, Python a Django.",
            "altText": "Delwedd o wefan rydw i wedi'i greu"
        },
        "3": {
            "title": "Sekai Experience",
            "description": "Mae hwn yn safle ar gyfer postio a rhannu profiadau. Fe'i hadeiladwyd gan ddefnyddio; EJS, NodeJS, Express a MongoDB.",
            "altText": "Delwedd o wefan rydw i wedi'i greu"
        },
        "4": {
            "title": "Safle Proffil Sapphy Doyle",
            "description": "Dyma'r safle proffil ar gyfer Sapphy Doyle. Fe'i hadeiladwyd gan ddefnyddio HTML, CSS, JavaScript a React.",
            "altText": "Delwedd o wefan rydw i wedi'i greu"
        },
        "5": {
            "title": "Amserlen Pomodoro a Rhestr Wirio'r Desg",
            "description": "Mae'r Ap Pomodoro Timer a Rhestr Wirio yn offeryn cynhyrchiant desktop a adeiladwyd gan ddefnyddio Electron, HTML, CSS, a JavaScript. Mae'n cyfuno timer Pomodoro ar gyfer rheoli amser â nodwedd rhestr wirio ar gyfer trefnu tasg.",
            "altText": "Ap desg Amserydd Pomodoro a Rhestr Wirio"
        }
    },
    "RecentTranslations": "Cyfieithiadau Diweddar",
    "translations": {
        "2": {
            "title": "Fy Mhroffil freeCodeCamp",
            "description": "Gweld mwy o fy nghyfieithiadau ar freeCodeCamp.",
            "altText": "Gweld mwy o fy nghyfieithiadau ar freeCodeCamp."
        },
        "3": {
            "title": "Gosod IP Statig yn Ubuntu – Tiwtorial Cyfeiriad IP Linux",
            "description": "Yn y mwyafrif o ffurfweddiadau rhwydwaith, mae gweinydd DHCP y llwybrydd yn aseinio'r cyfeiriad IP yn ddeinamig yn ddiofyn. Os ydych chi am sicrhau bod eich IP system yn aros yr un peth bob tro, gallwch ei orfodi i ddefnyddio IP statig.",
            "altText": "Sut i osod IP yn Ubuntu"
        },
        "4": {
            "title": "Enghraifft JSON Stringify - Sut i ddadansoddi gwrthrych JSON gyda JavaScript",
            "description": "Mae JSON, neu JavaScript Object Notation, o'n cwmpas ym mhobman. Os ydych wedi defnyddio ap gwe, mae'n debygol iawn bod yr ap gwe hwnnw'n defnyddio JSON i strwythuro data, ei storio, neu ei anfon rhwng gweinyddion a dyfeisiau.",
            "altText": "Sut i ddadansoddi gwrthrych JSON gyda JavaScript"
        },
        "5": {
            "title": "Sut i Ddiweddaru Node a NPM i'r Fersiwn Diweddaraf",
            "description": "Mae Node yn amgylchedd rhedeg ar gyfer gweithredu cod JavaScript y tu allan i'r porwr, ar ochr y gweinydd.",
            "altText": "Sut i Ddiweddaru Node a NPM i'r Fersiwn Diweddaraf"
        },
        "6": {
            "title": "Tiwtorial Sgriptio Bash – Sgriptiau Clogyn Linux a Llinell Orchymyn i Ddechreuwyr",
            "description": "Yn Linux, mae awtomeiddio prosesau yn dibynnu'n helaeth ar sgriptio clogyn. Mae hyn yn cynnwys creu ffeil sy'n cynnwys cyfres o orchmynion y gellir eu gweithredu gyda'i gilydd.",
            "altText": "Tiwtorial Sgriptio Bash – Sgriptiau Clogyn Linux a Llinell Orchymyn i Ddechreuwyr"
        },
        "7": {
            "title": "Adnewyddu Tudalen JavaScript – Sut i Ail-lwytho Tudalen mewn JS",
            "description": "Mae JavaScript yn iaith raglennu amlbwrpas sy'n galluogi datblygwyr i greu cymwysiadau gwe deinamig ac rhyngweithiol. Un dasg gyffredin mewn datblygiad gwe yw adnewyddu neu ail-lwytho tudalen we, naill ai i ddiweddaru ei chynnwys neu i sbarduno rhai gweithredoedd.",
            "altText": "Adnewyddu Tudalen JavaScript – Sut i Ail-lwytho Tudalen mewn JS"
        }
    },
    "RecentPosts": "Swyddi Diweddar",
    "footer": "Dyluniwyd a Datblygwyd gan Charlotte Stone"
}
