{
    "name": "Charlotte Stone",
    "title": "Datblygwr Meddalwedd, Cyfieithydd",
    "learnMore": "Dysgu Mwy",
    "about": "Am",
    "hello": "Hwyl!",
    "aboutText1": "Fi yw Charlotte, datblygwr gwe llawn pentwr brwd sy'n byw yn Ardal Abertawe Fwyaf. Gyda mwy na phum mlynedd o brofiad mewn cefnogaeth dechnegol a pheirianneg meddalwedd, rwy'n arbenigo mewn creu gwefannau deinamig gan ddefnyddio JavaScript, Python, React, Node, Django, a mwy. Mae fy ymagwedd yn canolbwyntio ar bobl, gan ganolbwyntio ar ddarparu gwerth pendant a sicrhau profiadau defnyddiwr di-dor.",
    "aboutText2": "Mae gen i gefndir cadarn mewn cyfieithu, ar ôl cymryd rhan mewn prosiectau amrywiol yn rhychwantu sectorau technoleg ac addysg. Tra bod Saesneg yn iaith frodorol i mi, rwy'n rhugl yn Japaneeg a Ffrangeg tra hefyd yn gyfarwydd â sawl iaith arall. Rwy'n barhaus yn chwilio am gyfleoedd newydd i helpu busnesau i gyrraedd cynulleidfa fyd-eang.",
    "RecentProjects": "Prosiectau Diweddar",
    "projects": {
        "1": {
            "title": "Prosiect 2",
            "description": "Dyma ddisgrifiad o Brosiect 2.",
            "altText": "Image of a website I've made"
        },
        "2": {
            "title": "Prosiect 3",
            "description": "Dyma ddisgrifiad o Brosiect 3.",
            "altText": "Image of a website I've made"
        },





        "98": {
            "title": "Safle Proffil Sapphy Doyle",
            "description": "Dyma'r safle proffil ar gyfer Sapphy Doyle. Fe'i hadeiladwyd gan ddefnyddio HTML, CSS, JavaScript a React.",
            "altText": "Delwedd o wefan rydw i wedi'i greu"
        },
        "99": {
            "title": "Amserlen Pomodoro a Rhestr Wirio'r Desg",
            "description": "Mae'r Ap Pomodoro Timer a Rhestr Wirio yn offeryn cynhyrchiant desktop a adeiladwyd gan ddefnyddio Electron, HTML, CSS, a JavaScript. Mae'n cyfuno timer Pomodoro ar gyfer rheoli amser â nodwedd rhestr wirio ar gyfer trefnu tasg.",
            "altText": "Ap desg Amserydd Pomodoro a Rhestr Wirio"
        }
    },
    "RecentPosts": "Swyddi Diweddar",
    "RecentTranslations": "Cyfieithiadau Diweddar",
    "translations": {
        "2": {
            "title": "Cyfieithiad 2",
            "description": "Dyma ddisgrifiad o Gyfieithiad 2.",
            "altText": "Delwedd o wefan rydw i wedi'i greu"
        },
        "3": {
            "title": "Cyfieithiad 3",
            "description": "Dyma ddisgrifiad o Gyfieithiad 3.",
            "altText": "Delwedd o wefan rydw i wedi'i greu"
        },











        "98": {
            "title": "Sut i Ddiweddaru Node a NPM i'r Fersiwn Diweddaraf",
            "description": "Mae Node yn amgylchedd rhedeg ar gyfer gweithredu cod JavaScript y tu allan i'r porwr, ar ochr y gweinydd.",
            "altText": "Sut i Ddiweddaru Node a NPM i'r Fersiwn Diweddaraf"
        },
        "99": {
            "title": "Tiwtorial Sgriptio Bash – Sgriptiau Clogyn Linux a Llinell Orchymyn i Ddechreuwyr",
            "description": "Yn Linux, mae awtomeiddio prosesau yn dibynnu'n helaeth ar sgriptio clogyn. Mae hyn yn cynnwys creu ffeil sy'n cynnwys cyfres o orchmynion y gellir eu gweithredu gyda'i gilydd.",
            "altText": "Tiwtorial Sgriptio Bash – Sgriptiau Clogyn Linux a Llinell Orchymyn i Ddechreuwyr"
        }
    },
    "footer": "Dyluniwyd a Datblygwyd gan Charlotte Stone"
}