
{
    "name": "Charlotte Stone",
    "title": "Programisto, Tradukisto",
    "learnMore": "Lernu Pli",
    "infoBar": "Charlotte Stone nuntempe estas malfermita al novaj ŝancoj! Kontaktu por diskuti vian projekton aŭ tradukajn bezonojn.",
    "contact": "Kontakto",
    "about": "Pri Mi",
    "hello": "Saluton!",
    "aboutText1": "Mi estas Charlotte, sindediĉa front-end retprogramisto bazita en Staffordshire, kiu pasias pri kreado de senjuntaj kaj allogaj uzantspertoj. Kun pli ol kvin jaroj da sperto en softvarprogramado, mi elstaras en utiligado de teknologioj kiel React, JavaScript, SCSS, kaj HTML por vivigi intuiciajn dezajnojn. Mia laboro prioritatas uzant-centran aliron, certigante ke funkcieco kaj estetiko kunfandiĝas por liveri efikajn solvojn.",
    "aboutText2": "Flua en la angla kaj kompetenta en la japana kaj franca, mi alportas tutmondan perspektivon al miaj projektoj, plibonigante alireblecon kaj komunikadon tra diversaj aŭdiencoj. Mia fono inkluzivas sukcesajn kunlaborojn en la teknologiaj kaj edukaj sektoroj, helpante entreprenojn atingi pli vastan publikon per novigaj solvoj.",
    "aboutText3": "Kiel fervora subtenanto de dumviva lernado, mi kontribuas al programistaj komunumoj kiel tradukisto por freeCodeCamp kaj helpas aspirantajn programistojn ĉe Code Institute. Ĉi tiu sperto reflektas mian engaĝiĝon dividi scion kaj krei alireblajn rimedojn por diversigita teknologia ekosistemo.",    "technologies": "Teknologioj",
    "home": "Hejmo",
    "languages": "Lingvoj",
    "project": "Projektoj",
    "RecentProjects": "Lastatempaj Projektoj",
    "projects": {
        "1": {
            "title": "Mia Github Profilo",
            "description": "Rigardu pli el mia laboro en Github.",
            "altText": "Rigardu pli el mia laboro en Github."
        },
        "7": {
            "title": "Projekto Exit Velocity",
            "description": "Blogo por sekvi mian programaran disvolvadon kaj studojn; MERN-stako.",
            "altText": "Logoo de Projekto Exit Velocity."
        },
        "3": {
            "title": "Mia Miksaĵo",
            "description": "Ĉi tio estas retejo por krei kaj dividi miksaĵojn uzante retajn ligojn. Ĝi estis konstruita uzante; JavaScript, Python kaj Django.",
            "altText": "Bildo de retejo kiun mi faris."
        },
        "4": {
            "title": "Sekai Sperto",
            "description": "Ĉi tio estas retejo por afiŝi kaj dividi spertojn. Ĝi estis konstruita uzante; EJS, NodeJS, Express kaj MongoDB.",
            "altText": "Bildo de retejo kiun mi faris."
        },
        "6": {
            "title": "YomiSaver",
            "description": "Retumila etendaĵo por faciligi la lernadon de la japana lingvo. Ĝi estis kreita per HTML, CSS kaj JavaScript.",
            "altText": "Etendaĵa piktogramo."
        },
        "5": {
            "title": "Labortabla Pomodoro Tempomezurilo kaj Kontrola Listo",
            "description": "La Pomodoro Tempomezurilo kaj Kontrola Listo Apliko estas produktiveca ilo konstruita uzante Electron, HTML, CSS kaj JavaScript. Ĝi kombinas Pomodoro-tempomezurilon por temp-administrado kun kontrol-listo por task-organizo.",
            "altText": "Pomodoro Tempomezurilo kaj Kontrola Listo labortabla aplikaĵo."
        }
    },
    "RecentTranslations": "Lastatempaj Tradukoj",
    "translations": {
        "2": {
            "title": "Mia freeCodeCamp Profilo",
            "description": "Rigardu pli el miaj tradukoj en freeCodeCamp.",
            "altText": "Rigardu pli el miaj tradukoj en freeCodeCamp."
        },
        "3": {
            "title": "Agordi Static IP en Ubuntu – Linuksa IP Adresa Lernilo",
            "description": "En plej multaj retaj agordoj, la DHCP-servilo de la enkursigilo atribuas la IP-adreson dinamike defaŭlte. Se vi volas certigi, ke via sistemo IP restas la sama ĉiufoje, vi povas devigi ĝin uzi statikan IP.",
            "altText": "Kiel agordi IP en Ubuntu"
        },
        "4": {
            "title": "JSON Stringify Ekzemplo – Kiel Analizi JSON Objekton kun JS",
            "description": "JSON, aŭ JavaScript Objekta Noto, estas ĉie. Se vi iam uzis retan aplikaĵon, estas tre verŝajne ke ĝi uzis JSON por strukturi, stoki, kaj transsendi datumojn inter ĝiaj serviloj kaj via aparato.",
            "altText": "Kiel analizi JSON objekton kun JavaScript"
        },
        "5": {
            "title": "Kiel Ĝisdatigi Node kaj NPM al la Plej Nova Versio",
            "description": "Node estas rultempa medio por ekzekuti JavaScript-kodon ekster la retumilo, ĉe la servila flanko.",
            "altText": "Kiel ĝisdatigi Node kaj NPM al la plej nova versio"
        },
        "6": {
            "title": "Bash Skriptado Lernilo – Linuksa Ŝelo Skripto kaj Komandlinio por Komencantoj",
            "description": "En Linukso, proceza aŭtomatigo forte dependas de ŝelo-skriptado. Ĉi tio implikas krei dosieron enhavantan serion da komandadoj, kiuj povas esti ekzekutitaj kune.",
            "altText": "Bash Skriptado Lernilo – Linuksa Ŝelo Skripto kaj Komandlinio por Komencantoj"
        },
        "7": {
            "title": "JavaScript Reŝargi Paĝon – Kiel Reŝargi Paĝon en JS",
            "description": "JavaScript estas multflanka programlingvo kiu permesas al programistoj krei dinamikajn kaj interaktivajn retajn aplikaĵojn. Unu komuna tasko en retprogramado estas reŝargi aŭ refreŝigi retpaĝon, ĉu por ĝisdatigi ĝian enhavon aŭ por aktivigi certajn agojn.",
            "altText": "JavaScript Reŝargi Paĝon – Kiel Reŝargi Paĝon en JS"
        }
    },
    "letMeHelpYou": "Lasu Min Helpi Vin!",
    "yourName": "Via Nomo",
    "yourEmail": "Via Retpoŝto",
    "yourMessage": "Via Mesaĝo",
    "sendMessage": "Sendu Mesaĝon",
    "enterYourName": "Enigu vian nomon",
    "enterYourEmail": "Enigu vian retpoŝton",
    "enterYourMessage": "Enigu vian mesaĝon",
    "RecentPosts": "Lastatempaj Afiŝoj",
    "showMore": "Montru Pli",
    "footer": "Desegnita kaj Evoluigita de Charlotte Stone",
    "GithubIcon": "Github Iko",
    "freeCodeCampIcon": "freeCodeCamp Iko",
    "LinkedInIcon": "LinkedIn Iko",
    "blueSkyIcon": "Blue Sky Iko"
}
